Repository: akivazo/makramir
Catalog: lib/l10n/app_*.arb
Languages: he

# introduction
source: Welcome to Macramir, Miryam’s Macrame Creations! 🌟 Dive into a world of intricate knots and beautiful designs, all handcrafted with love by Miryam herself. Each piece is a testament to her connection for this timeless art form, blending traditional techniques with modern aesthetics. From elegant wall hangings to charming plant holders, Miryam’s creations are perfect for adding a touch of bohemian elegance to any space. Explore the collection down this page and find the perfect piece to bring warmth and creativity into your home. Every item is made with care, ensuring you receive a unique and high-quality product that you’ll cherish for years to come.
he: ברוכים הבאים למקרמיר, יצירות המקרמה של מרים! 🌟 צללו לעולם של קשרים מורכבים ועיצובים יפים, כולם בעבודת יד באהבה על ידי מרים עצמה. כל יצירה היא עדות לחיבור לאמנות הנצחית הזו, המשלבת טכניקות מסורתיות עם אסתטיקה מודרנית. משטיחי קיר אלגנטים ועד מחזיקי צמחים מקסימים, היצירות של מרים מושלמות להוספת נגיעה של אלגנטיות בוהמית לכל חלל. חקרו את האוסף שלנו ומצאו את היצירה המושלמת שתביא חמימות ויצירתיות לביתכם. כל פריט נעשה בקפידה, כדי להבטיח שתקבלו מוצר ייחודי ואיכותי שתיהנו ממנו במשך שנים רבות.

source: First Name
he: שם פרטי

source: Last Name
he: שם משפחה

source: Email
he: אימייל

# address
source: Address For Shipping
he: כתובת למשלוח

# firstNameInvalid
source: Please enter your first name
he: אנא הכנס שם פרטי

# lastNameInvalid
source: Please enter your last name
he: אנא הכנס שם משפחה

# emailInvalid
source: Please enter a valid email address
he: אנא הכנס כתובת אימייל בפורמט תקין

# addressInvalid
source: Please enter your shipping address
he: אנא הכנס כתובת למשלוח

# checkoutFormTitle
source: Enter your information:
he: הכנס פרטים:

# checkoutPageTitle
source: Checkout
he: קופה

# checkoutSaveButton
source: Payment
he: תשלום

# paymentPageTitle
source: Payment
he: תשלום

# closeItemDetailsDialog
source: Close
he: סגור

# alreadyInBag
source: Already in the bag
he: התווסף לסל

source: Return item
he: החזר מוצר

# addItem
source: Pick item
he: הוסף מוצר

# cartClearItems
source: Clear items
he: רוקן סל

# proceedToCheckout
source: Proceed to checkout ({totalAmount} ₪)
he: המשך לקופה ({totalAmount} $)

# noItemsInBag
source: No items were picked
he: לא נבחרו פריטים.

# emptyBagTip
source: Add items by pressing the 'Pick Item' button under the item image.
he: הוסף פריטים ע''י לחיצה על הכפתור "הוסף מוצר" מתחת לתמונת המוצר.

# closeDrawer
source: close
he: סגור
